pftbest/msp430_svd/msp430-gcc-support-files/include/msp430fr5041.h
/* MPY32CTL0 Control Bits */
#define MPYDLY32                         (0x0200)        /* Delayed write mode. */
#define MPYDLY32_H                       (0x0002)
#define MPYDLY32_0                       (0x0000)        /* Writes are delayed until 64-bit result (RES0 to RES3) is 
                                                            available. */
#define MPYDLY32_1                       (0x0200)        /* Writes are delayed until 32-bit result (RES0 to RES1) is 
                                                            available. 8 MPYDLYWRTEN */
#define MPYDLY32_1_H                     (0x0002)
#define MPYDLYWRTEN                      (0x0100)        /* Delayed write enable. */
#define MPYDLYWRTEN_H                    (0x0001)
#define MPYDLYWRTEN_0                    (0x0000)        /* Writes are not delayed. */
#define MPYDLYWRTEN_1                    (0x0100)        /* Writes are delayed. */
#define MPYDLYWRTEN_1_H                  (0x0001)
#define MPYOP2_32                        (0x0080)        /* Multiplier bit width of operand 2 */
#define MPYOP2_32_L                      (0x0080)
#define MPYOP2_32_0                      (0x0000)        /* 16 bits. */
#define MPYOP2_32_1                      (0x0080)        /* 32 bits. */
#define MPYOP2_32_1_L                    (0x0080)
#define MPYOP2_32__16                    (0x0000)        /* 16 bits. */
#define MPYOP2_32__32                    (0x0080)        /* 32 bits. */
#define MPYOP2_32__32_L                  (0x0080)
#define MPYOP1_32                        (0x0040)        /* Multiplier bit width of operand 1 */
#define MPYOP1_32_L                      (0x0040)
#define MPYOP1_32_0                      (0x0000)        /* 16 bits. */
#define MPYOP1_32_1                      (0x0040)        /* 32 bits. */
#define MPYOP1_32_1_L                    (0x0040)
#define MPYOP1_32__16                    (0x0000)        /* 16 bits. */
#define MPYOP1_32__32                    (0x0040)        /* 32 bits. */
#define MPYOP1_32__32_L                  (0x0040)
#define MPYM                             (0x0030)        /* Multiplier mode */
#define MPYM_L                           (0x0030)
#define MPYM0                            (0x0010)        /* Multiplier mode */
#define MPYM0_L                          (0x0010)
#define MPYM1                            (0x0020)        /* Multiplier mode */
#define MPYM1_L                          (0x0020)
#define MPYM_0                           (0x0000)        /* MPY  Multiply */
#define MPYM_1                           (0x0010)        /* MPYS  Signed multiply */
#define MPYM_1_L                         (0x0010)
#define MPYM_2                           (0x0020)        /* MAC  Multiply accumulate */
#define MPYM_2_L                         (0x0020)
#define MPYM_3                           (0x0030)        /* MACS  Signed multiply accumulate */
#define MPYM_3_L                         (0x0030)
#define MPYM__MPY                        (0x0000)        /* MPY  Multiply */
#define MPYM__MPYS                       (0x0010)        /* MPYS  Signed multiply */
#define MPYM__MPYS_L                     (0x0010)
#define MPYM__MAC                        (0x0020)        /* MAC  Multiply accumulate */
#define MPYM__MAC_L                      (0x0020)
#define MPYM__MACS                       (0x0030)        /* MACS  Signed multiply accumulate */
#define MPYM__MACS_L                     (0x0030)
#define MPYSAT                           (0x0008)        /* Saturation mode */
#define MPYSAT_L                         (0x0008)
#define MPYSAT_0                         (0x0000)        /* Saturation mode disabled. */
#define MPYSAT_1                         (0x0008)        /* Saturation mode enabled. */
#define MPYSAT_1_L                       (0x0008)
#define MPYSAT__DISABLE                  (0x0000)        /* Saturation mode disabled. */
#define MPYSAT__ENABLE                   (0x0008)        /* Saturation mode enabled. */
#define MPYSAT__ENABLE_L                 (0x0008)
#define MPYFRAC                          (0x0004)        /* Fractional mode. */
#define MPYFRAC_L                        (0x0004)
#define MPYFRAC_0                        (0x0000)        /* Fractional mode disabled. */
#define MPYFRAC_1                        (0x0004)        /* Fractional mode enabled. */
#define MPYFRAC_1_L                      (0x0004)
#define MPYFRAC__DISABLE                 (0x0000)        /* Fractional mode disabled. */
#define MPYFRAC__ENABLE                  (0x0004)        /* Fractional mode enabled. */
#define MPYFRAC__ENABLE_L                (0x0004)
#define MPYC                             (0x0001)        /* Carry of the multiplier */
#define MPYC_L                           (0x0001)
#define MPYC_0                           (0x0000)        /* No carry for result. */
#define MPYC_1                           (0x0001)        /* Result has a carry. */
#define MPYC_1_L                         (0x0001)


/*****************************************************************************
 MTIF Registers
*****************************************************************************/

#define __MSP430_HAS_MTIF__                   /* Definition to show that module is available */
#define __MSP430_BASEADDRESS_MTIF__ 0x0F00
#define MTIF_BASE              __MSP430_BASEADDRESS_MTIF__

sfr_w(MTIFPGCNF);                             /* Pulse Generator Configuration Register */
sfr_b(MTIFPGCNF_L);
sfr_b(MTIFPGCNF_H);
sfr_w(MTIFPGKVAL);                            /* Pulse Generator Value Register */
sfr_b(MTIFPGKVAL_L);
sfr_b(MTIFPGKVAL_H);
sfr_w(MTIFPGCTL);                             /* Pulse Generator Control Register */
sfr_b(MTIFPGCTL_L);
sfr_b(MTIFPGCTL_H);
sfr_w(MTIFPGSR);                              /* Pulse Generator Status Register */
sfr_b(MTIFPGSR_L);
sfr_b(MTIFPGSR_H);
sfr_w(MTIFPCCNF);                             /* Pulse Counter Configuration Register */
sfr_b(MTIFPCCNF_L);
sfr_b(MTIFPCCNF_H);
sfr_w(MTIFPCR);                               /* Pulse Counter Value Register */
sfr_b(MTIFPCR_L);
sfr_b(MTIFPCR_H);
sfr_w(MTIFPCCTL);                             /* Pulse Counter Control Register */
sfr_b(MTIFPCCTL_L);
sfr_b(MTIFPCCTL_H);
sfr_w(MTIFPCSR);                              /* Pulse Counter Status Register */
sfr_b(MTIFPCSR_L);
sfr_b(MTIFPCSR_H);
sfr_w(MTIFTPCTL);                             /* Measurement Test Port Control Register */
sfr_b(MTIFTPCTL_L);
sfr_b(MTIFTPCTL_H);

/* MTIF Register Offsets */
#define OFS_MTIFPGCNF                    (0x0000)
#define OFS_MTIFPGCNF_L                  OFS_MTIFPGCNF
#define OFS_MTIFPGCNF_H                  OFS_MTIFPGCNF+1
#define OFS_MTIFPGKVAL                   (0x0002)
#define OFS_MTIFPGKVAL_L                 OFS_MTIFPGKVAL
#define OFS_MTIFPGKVAL_H                 OFS_MTIFPGKVAL+1
#define OFS_MTIFPGCTL                    (0x0004)
#define OFS_MTIFPGCTL_L                  OFS_MTIFPGCTL
#define OFS_MTIFPGCTL_H                  OFS_MTIFPGCTL+1
#define OFS_MTIFPGSR                     (0x0006)
#define OFS_MTIFPGSR_L                   OFS_MTIFPGSR
#define OFS_MTIFPGSR_H                   OFS_MTIFPGSR+1
#define OFS_MTIFPCCNF                    (0x0008)
#define OFS_MTIFPCCNF_L                  OFS_MTIFPCCNF
#define OFS_MTIFPCCNF_H                  OFS_MTIFPCCNF+1
#define OFS_MTIFPCR                      (0x000A)
#define OFS_MTIFPCR_L                    OFS_MTIFPCR
#define OFS_MTIFPCR_H                    OFS_MTIFPCR+1
#define OFS_MTIFPCCTL                    (0x000C)
#define OFS_MTIFPCCTL_L                  OFS_MTIFPCCTL
#define OFS_MTIFPCCTL_H                  OFS_MTIFPCCTL+1
#define OFS_MTIFPCSR                     (0x000E)
#define OFS_MTIFPCSR_L                   OFS_MTIFPCSR
#define OFS_MTIFPCSR_H                   OFS_MTIFPCSR+1
#define OFS_MTIFTPCTL                    (0x0010)
#define OFS_MTIFTPCTL_L                  OFS_MTIFTPCTL
#define OFS_MTIFTPCTL_H                  OFS_MTIFTPCTL+1

/* MTIF Control Bits */

